import Link from "next/link";
import styles from "./home.module.css";

export default function Home() {
  return (
    <section className={styles.hmdev}>
      <div className={styles.home}>
        <h1>မြန်မာပြက္ခဒိန်တွက်ချက်ခြင်း</h1>
        <small>
          <i>ယခုပရောဂျက်သည်လုပ်ဆောင်ဆဲဖြစ်သည်။</i>
        </small>
        <hr />
        <ol>
          <li>
            <p>
              <b>မိတ်ဆက်</b>
            </p>
            <p>
              Javascript
              ကိုလေ့လာသည့်အခါပရောဂျက်တစ်ခုတည်ပြီးလုပ်ဖို့စဥ်းစားမိပါသည်။မြန်မာပြက္ခဒိန်တွက်ချက်မှုများနှင့်ဆက်စပ်သည်များအားစုစည်းထားရန်အတွေးပေါ်လာသည့်အတွက်ဆောင်ရွက်ဖြစ်ပါသည်။
              မြန်မာပြက္ခဒိန်၏ရှုပ်ထွေးသောနားလည်ရခက်သောဝေါဟာရများနှင့်တွက်ချက်ရန်အခြေခံရသည့်အချက်များအားကျော်လွားဖို့အတွက်ကြိုးစားအားထုတ်ခဲ့သူတွေများစွာရှိပါသည်။
              ယခုပရောဂျက်၏ Algorithm
              များသည်ကိုယ်ပိုင်မဟုတ်ပါများစွာသောကြိုးစားခဲ့သူများထဲမှ
              သာမန်လူများနားလည်နိုင်အောင်ဖန်တီးခဲ့မှတ်တမ်းများထားခဲ့သော ကိုဝဏ္ဏ
              ကိုရန်နိုင်အေး ဦးငြိမ်းအေး တို့၏ Algorithm များအားအခြေခံပါသည်။
              ကိုရန်နိုင်အေး၏ Algorithm အားလုံးဝရယူသူံးစွဲထားပါသည်။
            </p>
          </li>
          <li>
            <p>
              <b>နေ့စွဲများအားဂျုလီယံရက်သို့ပြောင်းခြင်း</b>
            </p>
            <p>
              မြန်မာပြက္ခဒိန်အားအများသုံးပြက္ခဒိန်နှင့်ယှဥ်တွဲချက်နိုင်ရန်အတွက်ဂျုလီယံရက်စွဲအသုံးပြုရန်လိုအပ်သဖြင့်ပထမဆုံးရက်စွဲနှင့်အချိန်များအားဂျုလီယံသို့ပြောင်းရမည်ဖြစ်သည်။{" "}
              <Link
                href={"/julian_date"}
                target="_blank"
                className={styles.lnk}
              >
                Julian Date Converter
              </Link>{" "}
            </p>
          </li>
        </ol>
      </div>
    </section>
  );
}
