import Link from "next/link";
import styles from "./home.module.css";

export default function Home() {
  return (
    <section>
      <div className={"content"}>
        <h1>MyCal</h1>
        <div className="nav">
          <Link href={"/julian"} target="_blank" className={"link"}>
            Julian
          </Link>
          <Link href={"/gregorian"} target="_blank" className={"link"}>
            Gregorian
          </Link>
        </div>
        <hr />
        <div>
          <h3>မိတ်ဆက်</h3>
          <p className="content">
            မြန်မာပြက္ခဒိန်တွက်ချက်မှုဆိုင်ရာများလေ့လာရန်ရည်ရွယ်ပါသည်။မြန်မာပြက္ခဒိန်သည်ယနေ့အထိမြန်မာပြည်သူအများစုအသုံးပြုနေဆဲဖြစ်သည်။မြန်မာ့ရိုးရာကိုယ်ပိုင်စစ်စစ်လို့လုံးဝပြောလို့မရသော်လည်း
            အရှေ့တိုင်းယဥ်ကျေးမှုလွမ်းမိုးသောမြန်မာ့သမိုင်း၏အဖြစ်အပျက်များမှတ်တမ်းတင်ထားသောမြန်မာ့ဟန်တွက်ချက်မှုများနှင့်နှစ်ပေါင်းများစွာတည်တန့်လာသောမြန်မာ့အထိမ်းအမှတ်တစ်ခုဖြစ်သည်။ခေတ်ပညာတတ်လူငယ်အတော်များများ
            မြန်မာ့ပြက္ခဒိန်ကို
            ကမ္ဘာသုံးပြက္ခဒိန်နှင့်အတူယှဥ်တွဲအသုံးပြုနိုင်ရန်ကြိုးစားအားထုတ်ခဲ့ကြပါသည်။
            တဖက်မှာလည်းအခြေအနေအရပ်ရပ်အပေါ်မူတည်ပြီးဆုံးဖြတ်ရသည်များရှိသောကြောင့်
            နိုင်ငံအဆင့်အကြံပေးအဖွဲ့၏အတည်ပြုချက်ဖြင့်နှစ်တစ်နှစ်၏
            ပြက္ခဒိန်အားသတ်မှတ်ထုတ်ပြန်ပါသည်။
            ခေတ်လူငယ်များကြိုးစားအားထုတ်မှုများထဲမှ ကိုရန်နိုင်အေး၏ Algorithm
            သည် နှစ်ကူးချိန်များ ဝါထပ်နှစ်များ
            ဒုတိယဝါဆိုလပြည့်တွက်ချက်မှုများတွင်နိုင်ငံတော်မှထုတ်ပြန်ခဲ့သောနှစ်အလိုက်ပြက္ခဒိန်များနှင့်ကွဲလွဲမှုအလွန်နည်းပါသည်။
            Web app Mobile app များအတွက်အားပြုစရာ Algorithm ဖြစ်သည်ဟုယူဆပါသည်။
            ယခု Project သည် ကိုရန်နိုင်အေး၏ Algorithm
            အားအသေးစိတ်နားလည်အောင်ကြိုးစားမှု၏မှတ်တမ်းသာဖြစ်ပါသည်။
          </p>
        </div>
      </div>
    </section>
  );
}
